from ipsum.parse.parser import Parser

el_parser = Parser(
    "ΆΈΉΊΌΐΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩάέήίΰαβγδεζηθικλμνξοπρςστυφχψωϊϋόύώ",
    internal_punctuation=[",", ":", "·", "-", "–", "—"],
    endings=[";", ".", "!", "…"],
    matched_punctuation=[("(", ")"), ("«", "»")],
    stop_words=(
        ["και", "του", "της", "το", "την", "να", "η", "με", "για", "από", "που"]
        + ["των", "τα", "σε", "θα", "ο", "τη", "στο", "είναι", "στην", "τον"]
        + ["ποιος", "ποια", "ποιο", "πού", "πότε", "πώς", "τίνος", "τι", "γιατί"]
        + ["τους", "τις", "οι", "ότι", "μας", "στη", "δεν"]
        + ["αυτό", "ένα", "μια", "στον", "έχει", "στις", "στα", "αλλά", "ως"]
        + ["οποία", "ή", "αυτή", "όπως", "προς", "έχουν", "πόσος", "πόση", "πόσο"]
    ),
    additional_substitutions=[(r"•", r"·")],
)
