{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "ACCURACY",
    "1": "ANALYTE",
    "2": "BIOLOGICAL SUBSTANCE",
    "3": "COEFFICIENT OF VARIATION",
    "4": "COLUMN DIMENSIONS",
    "5": "COLUMN MANUFACTURER",
    "6": "COLUMN TEMPERATURE",
    "7": "FLOW RATE",
    "8": "INTERNAL STANDARD",
    "9": "IONIZATION METHOD",
    "10": "LIMIT OF QUANTIFICATION",
    "11": "LINEAR RANGE",
    "12": "MASS TRANSITION",
    "13": "MATRIX EFFECTS",
    "14": "METHOD",
    "15": "MOBILE PHASE",
    "16": "O",
    "17": "PRECISION",
    "18": "RUN TIME",
    "19": "SENSITIVITY"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "ACCURACY": 0,
    "ANALYTE": 1,
    "BIOLOGICAL SUBSTANCE": 2,
    "COEFFICIENT OF VARIATION": 3,
    "COLUMN DIMENSIONS": 4,
    "COLUMN MANUFACTURER": 5,
    "COLUMN TEMPERATURE": 6,
    "FLOW RATE": 7,
    "INTERNAL STANDARD": 8,
    "IONIZATION METHOD": 9,
    "LIMIT OF QUANTIFICATION": 10,
    "LINEAR RANGE": 11,
    "MASS TRANSITION": 12,
    "MATRIX EFFECTS": 13,
    "METHOD": 14,
    "MOBILE PHASE": 15,
    "O": 16,
    "PRECISION": 17,
    "RUN TIME": 18,
    "SENSITIVITY": 19
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.16.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}